app/views/users/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "testtest"], ["LIMIT", 1]]
---
  <div class="col-md-12">
    <h1><%= @user.first_name %>'s Profile <%= link_to (image_tag("/assets/pencil.jpg", width: "15px", height: "15px", :alt => "Edit profile")), edit_user_path(current_user.username) %></h1>