app/controllers/background_infos_controller.rb

  def index
    @background_infos = BackgroundInfo.all
---
SELECT "background_infos".* FROM "background_infos"

  def new
    @background_info = BackgroundInfo.new
    @user = User.find_by_username params[:user_username]
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test1"], ["LIMIT", 1]]

  def edit
    @background_info = BackgroundInfo.find params[:id]
---
SELECT  "background_infos".* FROM "background_infos" WHERE "background_infos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @background_info = BackgroundInfo.new(create_params)

    @user = User.find_by_username params[:user_username]
    return not_found("user not found!") if @user.nil?

    @background_info.user = @user

    if @background_info.save
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test1"], ["LIMIT", 1]]
INSERT INTO "background_infos" ("user_id", "jb_region", "national_jb", "local_jb", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["jb_region", "test"], ["national_jb", "test"], ["local_jb", "test"], ["created_at", 2016-11-29 01:47:08 UTC], ["updated_at", 2016-11-29 01:47:08 UTC]]

  def update
    @background_info = BackgroundInfo.find params[:id]

    if @background_info.update_attributes update_params
---
SELECT  "background_infos".* FROM "background_infos" WHERE "background_infos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "background_infos" SET "jb_region" = $1, "national_jb" = $2, "updated_at" = $3 WHERE "background_infos"."id" = $4  [["jb_region", "test1"], ["national_jb", "test1"], ["updated_at", 2016-11-29 02:21:16 UTC], ["id", 3]]

  def destroy
    background_info = BackgroundInfo.find params[:id]

    if background_info.destroy
---
SELECT  "background_infos".* FROM "background_infos" WHERE "background_infos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "background_infos" WHERE "background_infos"."id" = $1  [["id", 1]]

  def set_background_info
    @background_info = BackgroundInfo.find(params[:id])
---
SELECT  "background_infos".* FROM "background_infos" WHERE "background_infos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]