app/controllers/local_surveys_controller.rb

  def new
    @local_survey = LocalSurvey.new
    @user = User.find_by_username params[:user_username]
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "nwadih"], ["LIMIT", 1]]

  def edit
    @local_survey = LocalSurvey.find params[:id]
---
SELECT  "local_surveys".* FROM "local_surveys" WHERE "local_surveys"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @local_survey = LocalSurvey.new(local_survey_params)
    @user = User.find_by_username params[:user_username]
    return not_found("User not found!") if @user.nil?

    @local_survey.user = @user

    if @local_survey.save
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "nwadih"], ["LIMIT", 1]]
INSERT INTO "local_surveys" ("user_id", "jb_region", "national_jb", "local_jb", "nun_local_events", "num_related", "age_group", "num_jbers", "gender_ratio", "represented", "good_relationship", "awareness_of_meetings", "num_local_attenders", "num_regional_attenders", "num_international_attenders", "participates", "knowGoals", "GQ1", "GQ2", "GQ3", "GQ4", "GQ5", "GQ6", "GQ7", "GQ8", "GQ9", "G2Q1", "G2Q2", "G2Q3", "G2Q4", "G2Q5", "G2Q6", "G3Q1", "G3Q2", "G3Q3", "G3Q4", "G3Q5", "G4Q1", "G4Q2", "G4Q3", "G4Q4", "G4Q5", "G4Q6", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_local_survey
      @local_survey = LocalSurvey.find(params[:id])
---
SELECT  "local_surveys".* FROM "local_surveys" WHERE "local_surveys"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]