app/controllers/size_and_capacities_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test"], ["LIMIT", 1]]
---
  def new
    @size_and_capacity = SizeAndCapacity.new
    @user = User.find_by_username params[:user_username]

SELECT  "size_and_capacities".* FROM "size_and_capacities" WHERE "size_and_capacities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @size_and_capacity = SizeAndCapacity.find params[:id]

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test"], ["LIMIT", 1]]
INSERT INTO "size_and_capacities" ("user_id", "num_events", "num_related_area", "age_group", "involved", "gender_info", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @size_and_capacity = SizeAndCapacity.new(size_and_capacity_params)
    @user = User.find_by_username params[:user_username]
    return not_found("user not found!") if @user.nil?

    @size_and_capacity.user = @user

    if @size_and_capacity.save

SELECT  "size_and_capacities".* FROM "size_and_capacities" WHERE "size_and_capacities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "size_and_capacities" SET "num_events" = $1, "updated_at" = $2 WHERE "size_and_capacities"."id" = $3  [["num_events", 5], ["updated_at", 2016-11-29 03:08:45 UTC], ["id", 1]]
---
  def update
    @size_and_capacity = SizeAndCapacity.find params[:id]

    if @size_and_capacity.update_attributes update_params