app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "nwadih"], ["LIMIT", 1]]
---
  def show
    @user = User.find_by_username params[:username]

INSERT INTO "users" ("username", "password_digest", "first_name", "last_name", "email", "date_of_birth", "is_national", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new create_params

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "nwadih"], ["LIMIT", 1]]
---
  def edit
    @user = User.find_by_username params[:username]

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "testtest"], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "is_national" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["password_digest", "$2a$10$ueJM/z0Qq2AiPsg3Pif2Je5wMxgO5v0.2fDqisdptzfKsxDNG75c6"], ["is_national", false], ["updated_at", 2016-11-28 22:51:57 UTC], ["id", 1]]
---
  def update
    @user = User.find_by_username params[:username]
    @user.password = User.find_by_username params[:password]
    @user.password_confirmation = User.find_by_username params[:password_confirmation]

    if @user.update_attributes update_params

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "2"], ["LIMIT", 1]]
---
  def destroy
    user = User.find_by_username params[:username]